'''
Сколько единиц в двоичной записи числа
  4 ** 2016 + 2 ** 2018 - 8 ** 600 + 6
'''
print(bin(4 ** 2016 + 2 ** 2018 - 8 ** 600 + 6).count('1'))