'''
Сколько единиц в двоичной записи числа
  4 ** 2016 - 2 ** 2018 + 8 ** 800 - 80
'''
print(bin(4 ** 2016 - 2 ** 2018 + 8 ** 800 - 80).count('1'))