'''
Сколько значащих нулей в двоичной записи числа
8 ** 152 + 4 ** 915 - 2 ** 778 - 4 ** 71 - 2 ** 31 - 30
'''
print(bin(8 ** 152 + 4 ** 915 - 2 ** 778 - 4 ** 71 - 2 ** 31 - 30)[2:].count('0'))